{
  "101" : {
    "description" : "In this workshop I'll be showing how to use, understand and follow the best practices to use Typescript in the real life.",
    "id" : 101,
    "language" : "Spanish",
    "speakers" : [1],
    "tags" : [ "Typescript"],
    "title" : "Become a Typescript Jedi"
  },
  "102" : {
    "description" : "En el taller veremos desde los cimientos, cómo trabajar y comprender el funcionamiento de RxJS. El único conocimiento previo que necesita es comprender un poco de JavaScript.",
    "id" : 102,
    "language" : "Spanish",
    "speakers" : [0],
    "tags" : [ "Rxjs" ],
    "title" : "RxJS like a boss reloaded"
  },
  "103" : {
    "description" : "Aprende a escribir aplicaciones mantenibles en Angular independientemente del tamaño de tu equipo y su complejidad, utilizando los mejores consejos de diseño de architecturas.  \n En este taller vas a construir una aplicación que requerirá de todos tus conocimientos en escalabilidad y mantenibilidad. Bajo un formato de concurso, los participantes recibirán puntos cada vez que tomen la decisión correcta al momento de escribir código, el ganador toma el precio y se lleva la gloria eterna. \n En esta workshop escribirás código y aprenderás a: \n- Manejar el crecimiento de tu base de código de manera eficiente \n- Usar las mejores prácticas en módulo \n - Nombrar las variables de manera correcta \n- Gestionar el estado de tu aplicación efectivamente \n- Escalar tu estructura de carpetas \n- Imponer estándares de código \n- Reutilizar tu código al máximo",
    "id" : 103,
    "language" : "Spanish",
    "speakers" : [3],
    "tags" : [ "Architecture" ],
    "title" : "Building Scalable Angular Architectures"
  },
  "104" : {
    "description" : "In this workshop, attendees will learn how to build a component with Angular Material CDK, as well as some advanced directives.",
    "id" : 104,
    "language" : "Spanish",
    "speakers" : [5],
    "tags" : [ "Angular" ],
    "title" : "Advanced components/directives with the CDK"
  },
  "105" : {
    "description" : "Registry",
    "id" : 105,
    "image" : "/images/backgrounds/opening.jpg",
    "title" : "Registry"
  },
  "106" : {
    "description" : "Registry",
    "id" : 106,
    "image" : "/images/backgrounds/opening.jpg",
    "title" : "Registry"
  },
  "107" : {
    "description" : "Registry",
    "id" : 107,
    "image" : "/images/backgrounds/registration.jpg",
    "title" : "Registry"
  },
  "108" : {
    "description" : "Keynote",
    "id" : 108,
    "title" : "Keynote",
    "language" : "Spanish",
    "speakers" : [16],
    "tags" : [ "General" ]
  },
  "109" : {
    "description" : "El término Micro Frontends apareció por primera vez en ThoughtWorks Technology Radar a finales de 2016. Extiende los conceptos de micro servicios al mundo frontend. La tendencia actual es construir una aplicación de navegador potente y rica en funciones, también conocida como aplicación de una sola página, que se encuentra sobre una arquitectura de micro servicio. Con el tiempo, la capa frontend, a menudo desarrollada por un equipo separado, crece y se vuelve más difícil de mantener. Eso es lo que llamamos un monolito frontend.",
    "id" : 109,
    "language" : "Spanish",
    "speakers" : [7],
    "tags" : [ "Web" ],
    "title" : "Micro Frontends"
  },
  "110" : {
    "description" : "Aprende a escribir aplicaciones mantenibles en Angular independientemente del tamaño de tu equipo y su complejidad, utilizando los mejores consejos de diseño de architecturas.  \n En este taller vas a construir una aplicación que requerirá de todos tus conocimientos en escalabilidad y mantenibilidad. Bajo un formato de concurso, los participantes recibirán puntos cada vez que tomen la decisión correcta al momento de escribir código, el ganador toma el precio y se lleva la gloria eterna. \n En esta workshop escribirás código y aprenderás a: \n- Manejar el crecimiento de tu base de código de manera eficiente \n- Usar las mejores prácticas en módulo \n - Nombrar las variables de manera correcta \n- Gestionar el estado de tu aplicación efectivamente \n- Escalar tu estructura de carpetas \n- Imponer estándares de código \n- Reutilizar tu código al máximo",
    "id" : 110,
    "language" : "Spanish",
    "speakers" : [3],
    "tags" : [ "Architecture" ],
    "title" : "Scalable Angular Architecture"
  },
  "111" : {
    "description" : "El término Micro Frontends apareció por primera vez en ThoughtWorks Technology Radar a finales de 2016. Extiende los conceptos de micro servicios al mundo frontend. La tendencia actual es construir una aplicación de navegador potente y rica en funciones, también conocida como aplicación de una sola página, que se encuentra sobre una arquitectura de micro servicio. Con el tiempo, la capa frontend, a menudo desarrollada por un equipo separado, crece y se vuelve más difícil de mantener. Eso es lo que llamamos un monolito frontend.",
    "id" : 111,
    "language" : "Spanish",
    "speakers" : [11],
    "tags" : [ "Community" ],
    "title" : "¿Code Review es un ritual burocrático?"
  },
  "112" : {
    "description" : "Esta es la historia de una developer Boliviana que termina en Manhattan  y las experiencias que tiene haciendo una pasantía de 12 meses como web developer, es la primera vez que viaja fuera de su país, obviamente este es un cambio enorme y ella no estaba preparada para los retos que se venían, como aprender una cultura diferente, y entender el lenguaje hablado y corporal de sus nuevos compañeros, el creer que está sola, extrañar a todos sus amigos y familia que tenía en su país, pero lo que no había notado es que ellos seguían allí, un gran apoyo para ella han sido los amigos que han seguido en contacto virtualmente, también las comunidades de tecnología de las que había sido parte en su país la apoyaron bastante, una de esas comunidades es el GDG y WTM. Y como muchas latinas el mayor reto para ella es tener la capacidad de reconocer cuando no sabe algo y pedir ayuda, tiene miedo a que la juzguen por no saber. Hasta que entiende que no está mal preguntar y no está mal reconocer que cometemos errores, esa es la única manera de crecer tanto personalmente como profesionalmente. Ahora ella la chica de la historia está apoyando en su pasantía desde Nueva York a que más latinas tengan la oportunidad de tener una experiencia laboral fuera de su país. ",
    "id" : 112,
    "language" : "Spanish",
    "speakers" : [12],
    "tags" : [ "Community" ],
    "title" : "De LATAM a New York, jornada de una imilla dev"
  },
  "113" : {
    "description" : "Mostraremos como hacer  el Build Production  para poder publicar en Azure",
    "id" : 113,
    "language" : "Spanish",
    "speakers" : [13],
    "tags" : [ "Cloud" ],
    "title" : "Build Production Angular con Azure Cloud"
  },
  "114" : {
    "description" : "Sponsor: Scalable Path",
    "id" : 114,
    "image" : "/images/backgrounds/opening.jpg",
    "title" : "Sponsor: Scalable Path"
  },
  "115" : {
    "description" : "Break",
    "id" : 115,
    "image" : "/images/backgrounds/break.jpg",
    "title" : "Break"
  },
  "116" : {
    "description" : "One of the biggest questions that the developers have when they're start using Angular is what's the purpose?, which tools they can build with the framework?. In this talk I'll be showing some examples beyond to build apps with forms. ",
    "id" : 116,
    "language" : "Spanish",
    "speakers" : [1],
    "tags" : [ "Angular" ],
    "title" : "Angular: Beyond forms"
  },
  "117" : {
    "description" : "Las guias de estilo son las reglas para la construcción de interfaces que identifican a la marca. Le dan consistencia a los proyectos y optimzan el trabajo de los frontend developers dejándoles ocuparse solo de la lógica de la aplicación.",
    "id" : 117,
    "language" : "Spanish",
    "speakers" : [4],
    "tags" : [ "ui" ],
    "title" : "¿Por qué tu proyecto necesita una guía de estilos?"
  },
  "118" : {
    "description" : "Sponsor: Jala",
    "id" : 118,
    "image" : "/images/backgrounds/opening.jpg",
    "title" : "Sponsor: Jala"
  },
  "119" : {
    "description" : "Lunch Time",
    "id" : 119,
    "image" : "/images/backgrounds/lunch.jpg",
    "title" : "Lunch Time"
  },
  "120" : {
    "description" : "En esta charla se pretende mostrar tips y trucos de como mejorar el perfomance de las aplicaciones que se desarrolla con nativescript y angular, gracias a mi experiencia desarrollando y poniendo en producción varias apps utilizando esta tecnología, aprendí varios tips y trucos a considerar al momento de desarrollar una aplicación móvil trabajando con nativescript y angular, además de mostrar cuáles fueron las mejoras que se hicieron en la última versión de nativescript y como es que gracias a la última versión de angular se ha mejorado bastante el tema del performance que es sumamente importante en el desarrollo de aplicaciones móviles nativas.",
    "id" : 120,
    "language" : "Spanish",
    "speakers" : [10],
    "tags" : [ "Mobile" ],
    "title" : "Tips and tricks to improve performance in Nativescript with Angular"
  },
  "121" : {
    "description" : "Existen los tres (hibrido, bridge y nativo) lados de desarrollo y cada uno tiene sus ventajas y desventajas, en esta charla vamos a ver el estado actual del desarrollo híbrido versus el desarrollo nativo usando Angular. Veremos los casos de uso de cada uno y las herramientas que permitirán reducir tiempo e inversión aprovechando el potencial de Angular y su comunidad, logrando elegir las herramientas adecuadas con un arquitectura flexible.",
    "id" : 121,
    "language" : "Spanish",
    "speakers" : [9],
    "tags" : [ "Mobile" ],
    "title" : "Híbrido vs Nativo vs Bridge"
  },
  "122" : {
    "description" : "The correct management of  the state of our applications, has become  the new némesis that weigh down the modern developers. With the emergence of Redux as an alternative to handle state, it opens a path to the developers, and this is NgRx, the powerful state handler for Angular applications. But, ¿what would happen if we want to combine with Firebase?, ¿Is this possible?, ¿How would you handle the collections?, and most important..¿How to deal with a realtime database with NgRx?. In this talk let’s dive into how to integrate @ngrx/effects and @ngrx/entity to our application built in Angular and Firebase, and keep focus on other importants points, Font type… ",
    "id" : 122,
    "language" : "Spanish",
    "speakers" : [2],
    "tags" : [ "Firebase" ],
    "title" : "Firebase + NgRx ¿Isn't enough about reactiveness?"
  },
  "123" : {
    "description" : "En Bolivia ha crecido la intencionalidad de que los niños y jóvenes trabajen con tecnología en su diario vivir y en su proceso educativo. Es así que STEAM es un horizonte interesante para la Bolivia, pero también se ve lejano, teniendo en cuenta lo que sucede hoy en las aulas. Es fácil imaginar que implantarlo en la educación inicial o primaria, pues sería ideal, pero actualmente hay más casos de éxito con  jovencit@s de secundaria. En Cochabamba, hemos aplicado los principios STEAM (Ciencia, Tecnología, Ingeniería, Arte y Matemáticas) dentro de nuestro club de tecnología con estudiantes desde los 8 años hasta 17, desarrollando juegos  y aplicaciones webs o móviles. Deseamos mostrar el proceso Facilitador – estudiante en el proceso creativo de un juego una aplicación  usando en este caso las ventajas de Angular. ",
    "id" : 123,
    "language" : "Spanish",
    "speakers" : [14],
    "tags" : [ "Entrepreneurship" ],
    "title" : "STEAM+KIDS+ANGULAR: Amazing!"
  },
  "124" : {
    "description" : "I will give guidelines and tips to follow for designing a website from scratch without having web design skills. I will also provide some practical online resources to make the design easier. This talk will develop the following steps: 1. Decide the basics of your website 2. Get inspired 3. Plan the layout of your website 4. Define the basic design specifications 5. Build out the final product",
    "id" : 124,
    "language" : "Spanish",
    "speakers" : [15],
    "tags" : [ "ui" ],
    "title" : "Devs! Learn how to layout and design a website without hiring a web designer"
  },
  "125" : {
    "description" : "Sponsor: EDteam",
    "id" : 125,
    "image" : "/images/backgrounds/opening.jpg",
    "title" : "Sponsor: EDteam"
  },
  "126" : {
    "description" : "Break",
    "id" : 126,
    "image" : "/images/backgrounds/break.jpg",
    "title" : "Break"
  },
  "127" : {
    "description" : "Más allá del 'Hola Mundo', veremos como se comportan las aplicaciones desarrolladas con la plataforma IONIC en el mundo real. Que aspectos debemos cuidar, cuales son las buenas prácticas para evitar problemas en producción",
    "id" : 127,
    "language" : "Spanish",
    "speakers" : [8],
    "tags" : [ "Mobile" ],
    "title" : "IONIC in the real world: tips, tricks and best practices"
  },
  "128" : {
    "description" : "Angular Material CDK provides a low level suit of well-tested tools to add common interaction patterns for building UI Components. Israel will build a component using the CDK. Experts and  beginners alike can benefit with this knowledge.",
    "id" : 128,
    "language" : "Spanish",
    "speakers" : [5],
    "tags" : [ "Angular" ],
    "title" : "Make your own UI component suite with Angular Material CDK"
  },
  "129" : {
    "description" : "Monorepos, Blazingly-fast localized builds, and highly optimized output bundles are no longer a dream reserved just for the dream teams - they are now a big time reality in Angular You are prepared for what is coming: Angular Bazel & Closure!",
    "id" : 129,
    "language" : "Spanish",
    "speakers" : [0],
    "tags" : [ "Angular" ],
    "title" : "ABC, The new Alphabet for Angular"
  },
  "130" : {
    "description" : "Since Angular is one of the few frameworks in which there has been a continuous effort to include the animations natively implementing the Web Animations API, it is considered important that the assistant knows such functionality, and how it can be included in their projects to give greater emphasis without affecting the overall performance. This talk will be the continuation of the NG-Colombia 2017, where will be explained the way in which animations in the DOM elements can be created programmatically with the Animation Builder and the differences with the animation by states.",
    "id" : 130,
    "language" : "Spanish",
    "speakers" : [6],
    "tags" : [ "Angular" ],
    "title" : "Let’s Build up your animations with Angular"
  },
  "131" : {
    "description" : "Sponsor: Toptal",
    "id" : 131,
    "image" : "/images/backgrounds/opening.jpg",
    "title" : "Sponsor: EDteam"
  },
  "132" : {
    "description" : "Conference Panel",
    "id" : 132,
    "language" : "Spanish",
    "tags" : [ "Community" ],
    "title" : "Conference Panel"
  }
}
